{
  "format": "layers-model",
  "generatedBy": "direct-pytorch-export-v2",
  "convertedBy": null,
  "modelTopology": {
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js",
    "class_name": "Model",
    "config": {
      "name": "policy_value_net",
      "layers": [
        {
          "class_name": "InputLayer",
          "name": "input_1",
          "config": {
            "batch_input_shape": [
              null,
              81
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input_1"
          },
          "inbound_nodes": []
        },
        {
          "class_name": "Dense",
          "name": "trunk_0",
          "config": {
            "name": "trunk_0",
            "trainable": true,
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "trunk_2",
          "config": {
            "name": "trunk_2",
            "trainable": true,
            "dtype": "float32",
            "units": 512,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "trunk_0",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "trunk_4",
          "config": {
            "name": "trunk_4",
            "trainable": true,
            "dtype": "float32",
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "trunk_2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "trunk_6",
          "config": {
            "name": "trunk_6",
            "trainable": true,
            "dtype": "float32",
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "trunk_4",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "trunk_8",
          "config": {
            "name": "trunk_8",
            "trainable": true,
            "dtype": "float32",
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "trunk_6",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "policy_head_0",
          "config": {
            "name": "policy_head_0",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "trunk_8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "policy_head_2",
          "config": {
            "name": "policy_head_2",
            "trainable": true,
            "dtype": "float32",
            "units": 16,
            "activation": "linear",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "policy_head_0",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "value_head_0",
          "config": {
            "name": "value_head_0",
            "trainable": true,
            "dtype": "float32",
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "trunk_8",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "class_name": "Dense",
          "name": "value_head_2",
          "config": {
            "name": "value_head_2",
            "trainable": true,
            "dtype": "float32",
            "units": 1,
            "activation": "tanh",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null
          },
          "inbound_nodes": [
            [
              [
                "value_head_0",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "policy_head_2",
          0,
          0
        ],
        [
          "value_head_2",
          0,
          0
        ]
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "trunk_0/kernel",
          "shape": [
            81,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_0/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_2/kernel",
          "shape": [
            512,
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_2/bias",
          "shape": [
            512
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_4/kernel",
          "shape": [
            512,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_4/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_6/kernel",
          "shape": [
            256,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_6/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_8/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "trunk_8/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "policy_head_0/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "policy_head_0/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "policy_head_2/kernel",
          "shape": [
            64,
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "policy_head_2/bias",
          "shape": [
            16
          ],
          "dtype": "float32"
        },
        {
          "name": "value_head_0/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "value_head_0/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "value_head_2/kernel",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "value_head_2/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}